ХМНПФ_Общее/Documents/уп_Регламент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_Регламент</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПриостановкаВыплатПриНаличииПричиныПрекращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытиеСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ПричинаПрекращенияВыплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХМ_ПричиныПрекращенияВыплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приостановка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончанияОснований</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаПриостановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПричиныПриостановок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытиеДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаЗакрытия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытиеСчетовДосрочное</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытиеНеоплатаПервогоВзноса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорВыполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходВДругойНПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_Регламент/Ext/ObjectModule.bsl
Функция ПолучитьПричиныПрекращения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РегламентЗакрытиеСчетов.НомерСчета КАК НомерСчета,
		|	ХМ_ПричиныПрекращенияВыплаты.ПричинаПрекращенияВыплаты КАК ПричинаПрекращенияВыплаты
		|ИЗ
		|	Документ.уп_Регламент.ЗакрытиеСчетов КАК уп_РегламентЗакрытиеСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_ПричиныПрекращенияВыплаты КАК ХМ_ПричиныПрекращенияВыплаты
		|		ПО уп_РегламентЗакрытиеСчетов.НомерСчета = ХМ_ПричиныПрекращенияВыплаты.НомерСчета 
		|		И (НЕ ХМ_ПричиныПрекращенияВыплаты.Регистратор Ссылка Документ.уп_Регламент ИЛИ уп_РегламентЗакрытиеСчетов.Ссылка <> 
		|			Выразить(ХМ_ПричиныПрекращенияВыплаты.Регистратор КАК Документ.уп_Регламент).Ссылка)
		|ГДЕ
		|	уп_РегламентЗакрытиеСчетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	ТЗ.Индексы.Добавить("НомерСчета");
	Возврат ТЗ;
КонецФункции
	
//++https://redmine.npf.com/issues/4260
Функция ДобавитьДвиженияПоПриостановке(ТекСтрокаЗакрытиеСчетов, Отказ, Заголовок)
	Если Не ЗначениеЗаполнено(ТекСтрокаЗакрытиеСчетов.ХМ_ПричинаПрекращенияВыплаты) Тогда
		Отказ = Истина;
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету "+ТекСтрокаЗакрытиеСчетов.НомерСчета+" не заполнена причина прекращения",,Заголовок);
		Возврат Истина;
	КонецЕсли;
	// регистр СостоянияПС 
	Движение = Движения.уп_СостоянияПС.Добавить();
	Движение.Период = Дата;
	Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
	Движение.Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены;
	Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ОбязательстваВыполнены;
	Движение.ДатаУстановкиСостояния = Дата;	
	
	ТекПричинаПрекращения =  ДополнительныеСвойства.ТекПричиныПрекращения.НайтиСтроки(Новый Структура("НомерСчета",ТекСтрокаЗакрытиеСчетов.НомерСчета));
	
	Если ТекПричинаПрекращения.Количество() = 0 Тогда
		Движение = Движения.ХМ_ПричиныПрекращенияВыплаты.Добавить();
		Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
		Движение.ПричинаПрекращенияВыплаты = ТекСтрокаЗакрытиеСчетов.ХМ_ПричинаПрекращенияВыплаты;
	ИначеЕсли Не ТекПричинаПрекращения[0].ПричинаПрекращенияВыплаты = ТекСтрокаЗакрытиеСчетов.ХМ_ПричинаПрекращенияВыплаты Тогда
    	Сообщить("По счету " +Движение.НомерСчета +" уже зафиксирована другая причина прекращения "+ТекПричинаПрекращения[0].ПричинаПрекращенияВыплаты + ". Повторная фиксация не предусмотрена");
	Иначе
    	Сообщить("По счету " +Движение.НомерСчета +" уже зафиксирована причина прекращения "+ТекПричинаПрекращения[0].ПричинаПрекращенияВыплаты + ". Повторная фиксация не предусмотрена");
	КонецЕсли;
		
	Возврат Истина;
КонецФункции

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
#Вставка
//++https://redmine.npf.com/issues/4260
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТекПричиныПрекращения",ПолучитьПричиныПрекращения());
//--https://redmine.npf.com/issues/4260
#КонецВставки
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка); 

	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;  

	МассивСообщений = Новый СписокЗначений;
	Для Каждого ТекСтрокаЗакрытиеСчетов Из ЗакрытиеСчетов Цикл
#Вставка
//++https://redmine.npf.com/issues/4260
		Если ЭтотОбъект.ХМ_ПриостановкаВыплатПриНаличииПричиныПрекращения Тогда
			Если ДобавитьДвиженияПоПриостановке(ТекСтрокаЗакрытиеСчетов, Отказ, Заголовок) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
//--https://redmine.npf.com/issues/4260
#КонецВставки
		// регистр СостоянияПС 
		Движение = Движения.уп_СостоянияПС.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
		Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
		Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ОбязательстваВыполнены;

		ОбъектПС = ТекСтрокаЗакрытиеСчетов.НомерСчета.ПолучитьОбъект();
		ОбъектПС.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ДоговорВыполнен;
		ОбъектПС.Записать();

		////и в регистр записать причину, если ее там еще нет
		//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияПС.Получить(Новый Структура("НомерСчета", ТекСтрокаЗакрытиеСчетов.НомерСчета)).ПричинаЗакрытия;
		////если причина еще не прописана, то
		//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
		Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
		Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ДоговорВыполнен;
		//КонецЕсли;

		//состояние договора
		Если (ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.Вкладчик = ТекСтрокаЗакрытиеСчетов.НомерСчета.Участник) 
			или (ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо) Тогда
			Движение = Движения.уп_СостоянияДоговора.Добавить();
			Движение.Период = Дата;
			Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
			Движение.ПенсионныйДоговор = ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец;

			ПД = ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.ПолучитьОбъект();
			ПД.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ДоговорВыполнен;
			ПД.Записать();
		КонецЕсли;
	КонецЦикла;
	Если ЗакрытиеСчетов.Количество()>0 тогда
		ОчиститьДатуСледующейФиксации("ЗакрытиеСчетов");
	КонецЕсли;	

	//а неплохо бы проверить, что на договоре денег нет
	ПроверитьЗакрываемыеДоговоры(Отказ, Заголовок);
	//Если Отказ Тогда
	//	Возврат
	//КонецЕсли;	

	СостЗакрыт = Новый Массив;
	СостЗакрыт.Добавить(Перечисления.уп_СостоянияПС.Закрыт);
	СостЗакрыт.Добавить(Перечисления.уп_СостоянияПС.ОжиданиеВзносов);
	СостЗакрыт.Добавить(Перечисления.уп_СостоянияПС.ПустаяСсылка());

	Для каждого ТекСтрокаЗакрытиеДоговоров из ЗакрытиеДоговоров Цикл
		//закрываем сам договор
		Движение = Движения.уп_СостоянияДоговора.Добавить();
		Движение.Период = Дата;
		Движение.ПенсионныйДоговор = ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор;
		Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;

		ОбъектДоговор = ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор.ПолучитьОбъект();
		ОбъектДоговор.ПричинаЗакрытия = ТекСтрокаЗакрытиеДоговоров.ПричинаЗакрытия;
		ОбъектДоговор.Записать();

		////закрываем счет договора
		//Движение = Движения.уп_СостоянияПС.Добавить();
		//Движение.Период = Дата+1;
		//Движение.НомерСчета = ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор.ПенсионныйСчет;
		//Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
		//
		////указываем причину закрытия
		//
		////и в регистр записать причину, если ее там еще нет
		//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияПС.Получить(Новый Структура("НомерСчета", ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор.ПенсионныйСчет)).ПричинаЗакрытия;
		////если причина еще не прописана, то
		//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
		//	Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
		//	Движение.НомерСчета = ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор.ПенсионныйСчет;
		//	Движение.ПричинаЗакрытия = ТекСтрокаЗакрытиеДоговоров.ПричинаЗакрытия;
		//КонецЕсли;

		//возможно, стоит еще закрыть все незакрытые пенсионные счета по договору
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
		|	СостоянияПССрезПоследних.Состояние КАК Состояние,
		|	уп_ПричиныЗакрытияПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия
		|ИЗ
		|	РегистрСведений.уп_СостоянияПС.СрезПоследних(&ДатаДок, НомерСчета.Владелец = &ТекДоговор) КАК СостоянияПССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияПС.СрезПоследних(&ДатаДок, НомерСчета.Владелец = &ТекДоговор) КАК уп_ПричиныЗакрытияПССрезПоследних
		|		ПО СостоянияПССрезПоследних.НомерСчета = уп_ПричиныЗакрытияПССрезПоследних.НомерСчета
		|ГДЕ
		|	НЕ СостоянияПССрезПоследних.Состояние В (&СостЗакрыт)";

		Запрос.УстановитьПараметр("ДатаДок", МоментВремени());
		Запрос.УстановитьПараметр("ТекДоговор", ТекСтрокаЗакрытиеДоговоров.ПенсионныйДоговор);
		Запрос.УстановитьПараметр("СостЗакрыт", СостЗакрыт);

		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		Пока Выборка.Следующий() Цикл
			//закрываем счет 
			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
			//-<-НАЧАЛО ОРТИКОН -18.12.2017
			Если ТекСтрокаЗакрытиеДоговоров.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.Досрочное или 
				ТекСтрокаЗакрытиеДоговоров.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.ПереходВДругойНПФ Тогда
				Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.Расторжение;
			КонецЕсли; 
			//-<-КОНЕЦ ОРТИКОН -18.12.2017

			//указываем причину закрытия

			////и в регистр записать причину, если ее там еще нет
			//ТекПричина = Выборка.ПричинаЗакрытия;
			////если причина еще не прописана, то
			//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
			Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.ПричинаЗакрытия = ТекСтрокаЗакрытиеДоговоров.ПричинаЗакрытия;
			//КонецЕсли;
		КонецЦикла;


	КонецЦикла;	

	ПроверитьИсключаемыеСчета(Отказ, Заголовок); 
	СрезПенсионныхПравил = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПричинаЗакрытия = СрезПенсионныхПравил.ИсключатьПСизДоговораСПричиной;
	Если Не ЗначениеЗаполнено(ПричинаЗакрытия) Тогда 
		ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.Досрочное;	
	КонецЕсли;	
	Для Каждого ТекСтрокаЗакрытиеСчетов Из ЗакрытиеСчетовДосрочное Цикл
		// регистр СостоянияПС 
		Движение = Движения.уп_СостоянияПС.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
		Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
		Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ИсключениеИзДоговора;

		ОбъектПС = ТекСтрокаЗакрытиеСчетов.НомерСчета.ПолучитьОбъект();
		ОбъектПС.ПричинаЗакрытия = ПричинаЗакрытия;
		ОбъектПС.Записать();

		////и в регистр записать причину, если ее там еще нет
		//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияПС.Получить(Новый Структура("НомерСчета", ТекСтрокаЗакрытиеСчетов.НомерСчета)).ПричинаЗакрытия;
		////если причина еще не прописана, то
		//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
		Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
		Движение.Период = Дата;
		Движение.НомерСчета = ТекСтрокаЗакрытиеСчетов.НомерСчета;
		Движение.ПричинаЗакрытия = ПричинаЗакрытия;
		//КонецЕсли;

		//состояние договора
		Если (ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.Вкладчик = ТекСтрокаЗакрытиеСчетов.НомерСчета.Участник) 
			или (ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо) Тогда
			Движение = Движения.уп_СостоянияДоговора.Добавить();
			Движение.Период = Дата;
			Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
			Движение.ПенсионныйДоговор = ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец;

			ПД = ТекСтрокаЗакрытиеСчетов.НомерСчета.Владелец.ПолучитьОбъект();
			ПД.ПричинаЗакрытия = ПричинаЗакрытия;
			ПД.Записать();
		КонецЕсли;
	КонецЦикла;
	Если ЗакрытиеСчетовДосрочное.Количество()>0 тогда
		ОчиститьДатуСледующейФиксации("ЗакрытиеСчетовДосрочное");
	КонецЕсли;	

	Если Приостановка.Количество()>0 Тогда
		ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
		Если ЗначениеЗаполнено(ПенсионныеПравила.ОкончаниеСправкиМСЭ) Тогда
			КонечноеСостояние = ПенсионныеПравила.ОкончаниеСправкиМСЭ;
		Иначе
			КонечноеСостояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены; 
		КонецЕсли;	
		Для Каждого ТекСтрокаПриостановки из Приостановка Цикл
			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаПриостановки.НомерСчета;
			Движение.Состояние = КонечноеСостояние;
			Если ЗначениеЗаполнено(ТекСтрокаПриостановки.ПричинаПриостановки) Тогда 
				Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ОкончаниеПенсионныхОснований;
			КонецЕсли; 
			Движение.Основание = ТекСтрокаПриостановки.Основание;
			Движение.ДатаОкончанияОснований = ТекСтрокаПриостановки.ДатаОкончанияОснований;
			Движение.ДатаУстановкиСостояния = Дата;
		КонецЦикла;	
	КонецЕсли;    

	Если ВидОперации = Перечисления.уп_ВидыОперацийРегламент.ЗакрытиеНеоплатаПервогоВзноса Тогда
		Для Каждого ТекСтрокаЗакрытиеНеоплатаПервогоВзноса Из ЗакрытиеНеоплатаПервогоВзноса Цикл

			Движение = Движения.уп_СостоянияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета;
			Движение.Состояние = Перечисления.уп_СостоянияПС.Закрыт;
			Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.ЗакрытиеНеоплатаПервогоВзноса;

			ОбъектПС = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета.ПолучитьОбъект();
			ОбъектПС.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.НеоплатаПервогоВзноса;
			ОбъектПС.Записать();

			////и в регистр записать причину, если ее там еще нет
			//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияПС.Получить(Новый Структура("НомерСчета", ТекСтрокаЗакрытиеСчетов.НомерСчета)).ПричинаЗакрытия;
			////если причина еще не прописана, то
			//Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
			Движение = Движения.уп_ПричиныЗакрытияПС.Добавить();
			Движение.Период = Дата;
			Движение.НомерСчета = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета;
			Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.НеоплатаПервогоВзноса;
			//КонецЕсли;

			//состояние договора
			Если (ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета.Владелец.Вкладчик = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета.Участник) 
				или (ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.НомерСчета.Владелец.Вкладчик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо) Тогда
				Движение = Движения.уп_СостоянияДоговора.Добавить();
				Движение.Период = Дата;
				Движение.Состояние = Перечисления.уп_СостоянияДоговора.Закрыт;
				Движение.ПенсионныйДоговор = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.ПенсионныйДоговор;

				ПД = ТекСтрокаЗакрытиеНеоплатаПервогоВзноса.ПенсионныйДоговор.ПолучитьОбъект();
				ПД.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияПС.НеоплатаПервогоВзноса;
				ПД.Записать();
			КонецЕсли;
		КонецЦикла;
		Если ЗакрытиеНеоплатаПервогоВзноса.Количество()>0 тогда
			ОчиститьДатуСледующейФиксации("ЗакрытиеНеоплатаПервогоВзноса");
		КонецЕсли;	
	КонецЕсли;

	Если ВидОперации = Перечисления.уп_ВидыОперацийРегламент.ВозвратВНакопительныйПериод Тогда
		//проверить причину закрытия
		ПровестиВосстановленияНакопительногоПериода(Отказ,МассивСообщений);
	КонецЕсли;	

	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
	// записываем движения регистров
	Движения.уп_СостоянияПС.Записать();
КонецПроцедуры
